Config/Catalogs/ШаблоныЗаполненияПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныЗаполненияПП</Name>
			<Comment>Шаблоны текста поля платежного поручения "Назначение платежа"</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделительЭлементовПовторяющейсяЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданныхИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Образ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДопРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДопСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяУчетныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Последовательность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючУсловнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПовторяющаясяЧасть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПутьКДанным</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПример</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВПоследовательности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДерева</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ШаблоныЗаполненияПП/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Картинки = Новый Соответствие;
	Картинки.Вставить("Справочник", БиблиотекаКартинок.СправочникОбъект);
	Картинки.Вставить("Документ",   БиблиотекаКартинок.ДокументОбъект);
	
	Объекты = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьОбслуживаемыеОбъектыМетаданных();
	
	Для Каждого ВидДокумента Из Объекты Цикл
		Элементы.ОбъектМетаданных.СписокВыбора.Добавить(ВидДокумента.Имя, ВидДокумента.Представление(), ,
					Картинки[СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВидДокумента.ПолноеИмя(), ".")[0]]);
	КонецЦикла;
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("ОбъектМетаданныхИмя") Тогда
			Объект.ОбъектМетаданныхИмя = Параметры.ЗначенияЗаполнения.ОбъектМетаданныхИмя;
			Объект.ПредставлениеОбъекта = Параметры.ЗначенияЗаполнения.ОбъектМетаданныхИмя;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданныхИмя) Тогда
		ИнициализироватьДоступныеПоля();
		Элементы.ОбъектМетаданных.Доступность = ЛОЖЬ;
		
		СчитатьНастройкиОтборов();
	КонецЕсли;
	
	Если Объект.РазделительЭлементовПовторяющейсяЧасти = "" Тогда
		Объект.РазделительЭлементовПовторяющейсяЧасти = ";";
	КонецЕсли;
	
	ТекущаяСтрока = 0;
	
	ПолучитьМакет();
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры // ПриСозданииНаСервере

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Объект.Последовательность.Количество() = 0 Тогда
		ПредставлениеФормата = "";
		ОтрисоватьШаблон();
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "СменилсяТекущийПараметрШаблона" Тогда
		Элементы.ШаблонРедактироватьПараметр.Доступность = (Объект.Последовательность[Параметр].ТипПараметра = 1);
		Элементы.ШаблонТекстаКонтекстноеМенюРедактировать.Доступность = (Объект.Последовательность[Параметр].ТипПараметра = 1);
		
		Если Объект.Последовательность[Параметр].НомерВПоследовательности > 0 Тогда
			СоставнойПараметр = ИСТИНА;
			Элементы.ШаблонТекстаКонтекстноеМенюСоставнойПараметр.Пометка = ИСТИНА;
		Иначе
			СоставнойПараметр = ЛОЖЬ;
			Элементы.ШаблонТекстаКонтекстноеМенюСоставнойПараметр.Пометка = ЛОЖЬ;
		КонецЕсли;
		
		Если Объект.Последовательность[Параметр].Тип = "НДС" Тогда
			ПредставлениеФормата = ПредставлениеФорматаНДС(Объект.Последовательность[Параметр].Формат);
		ИначеЕсли Лев(Объект.Последовательность[Параметр].Тип, 3) = "КБК" Тогда
			Если Прав(Объект.Последовательность[Параметр].Тип, 1) = "+" Тогда
				ПредставлениеФормата = "КБК с разбиением на группы";
			Иначе
				ПредставлениеФормата = "КБК без разбиения на группы";
			КонецЕсли;
		Иначе
			ТекущийПараметр = Объект.Последовательность[Параметр];
			
			Если ТекущийПараметр.Тип = "Дата" Тогда
				ПредставлениеФормата = Формат(ТекущаяДата(), ТекущийПараметр.Формат);
			ИначеЕсли ТекущийПараметр.Тип = "Число" Тогда
				ПредставлениеФормата = Формат(999999.99, ТекущийПараметр.Формат);
			ИначеЕсли ТекущийПараметр.Тип = "Булево" Тогда
				ПредставлениеФормата = "Ложь: " + Формат(ЛОЖЬ, ТекущийПараметр.Формат) + "; Истина: " + Формат(ИСТИНА, ТекущийПараметр.Формат);
			Иначе
				ПредставлениеФормата = "";
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ДоступныеПоля.ТекущаяСтрока = Объект.Последовательность[Параметр].НомерСтрокиДерева;
		
		ОтрисоватьШаблон();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтбора.Настройки, Новый СжатиеДанных(9));
КонецПроцедуры // ПередЗаписьюНаСервере

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхОчистка(Элемент, СтандартнаяОбработка)
	Если Объект.Последовательность.Количество() > 0 Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		
		Оповещение = Новый ОписаниеОповещения("ОбъектМетаданныхОчисткаОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Текущая настройка будет утеряна. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ДоступныеПоля.ПолучитьЭлементы().Очистить();
		Объект.Последовательность.Очистить();
		ПолучитьМакет();
		ОтрисоватьШаблон();
	КонецЕсли;
КонецПроцедуры // ОбъектМетаданныхОчистка

&НаКлиенте
Процедура ОбъектМетаданныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И (ВыбранноеЗначение <> ТекущийОбъектМетаданных) Тогда
		Если Объект.Последовательность.Количество() > 0 Тогда
			Оповещение = Новый ОписаниеОповещения("ОбъектМетаданныхОбработкаВыбораОповещение", ЭтотОбъект, ВыбранноеЗначение);
			ПоказатьВопрос(Оповещение, НСтр("ru='Текущая настройка будет утеряна. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		Иначе
			Объект.ОбъектМетаданныхИмя = ВыбранноеЗначение;
			ОбработатьВыборДокумента();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.Последовательность.Количество() > 0 Тогда
		ТекущийОбъектМетаданных = Объект.ОбъектМетаданныхИмя;
	КонецЕсли;
КонецПроцедуры // ОбъектМетаданныхНачалоВыбора

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ДобавитьВШаблон();
	
КонецПроцедуры // ДоступныеПоляВыбор

&НаКлиенте 
Процедура СоставнойПараметрПриИзменении(Элемент)
	Если Объект.Последовательность.Количество() = 0 Тогда
		СоставнойПараметр = ЛОЖЬ;
		Возврат;
	КонецЕсли;
	
	Если СоставнойПараметр Тогда
		ТекущийПараметр = Объект.Последовательность[ТекущаяСтрока];
		
		ТекущийПараметр.НомерВПоследовательности = ?(ТекущаяСтрока > 0, Объект.Последовательность[ТекущаяСтрока - 1].НомерВПоследовательности + 1, 1);
	Иначе
		ТекущийПараметр = Объект.Последовательность[ТекущаяСтрока];
		
		ТекущийПараметр.НомерВПоследовательности = 0;
		
		Если ТекущаяСтрока > 0 Тогда
			ПредыдущийПараметр = Объект.Последовательность[ТекущаяСтрока - 1];
			
			ПредыдущийПараметр.НомерВПоследовательности = ?(ПредыдущийПараметр.НомерВПоследовательности = 1, 0, ПредыдущийПараметр.НомерВПоследовательности);
		КонецЕсли;
		
		Если (Объект.Последовательность.Количество() - 1) >= (ТекущаяСтрока + 2) Тогда
			Если Объект.Последовательность[ТекущаяСтрока + 2].НомерВПоследовательности = 0 Тогда
				Объект.Последовательность[ТекущаяСтрока + 1].НомерВПоследовательности = 0;
			КонецЕсли;
		ИначеЕсли (Объект.Последовательность.Количество() - 1) = (ТекущаяСтрока + 1) Тогда
			Объект.Последовательность[ТекущаяСтрока + 1].НомерВПоследовательности = 0;
		КонецЕсли;
	КонецЕсли;
	
	Перенумерация();
	
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
	
	Элементы.ШаблонТекстаКонтекстноеМенюСоставнойПараметр.Пометка = СоставнойПараметр;
	
	Модифицированность = ИСТИНА;
КонецПроцедуры // СоставнойПараметрПриИзменении

&НаКлиенте
Процедура ШаблонТекстаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Если ДанныеСобытия.Element.id <> "" Тогда
		Попытка
			ТекущаяСтрока = Число(ДанныеСобытия.Element.id) - 1;
		Исключение
			ТекущаяСтрока = Объект.Последовательность.Количество() - 1;
		КонецПопытки;
	КонецЕсли;
	
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
КонецПроцедуры // ШаблонТекстаПриНажатии

&НаКлиенте
Процедура ШаблонТекстаДокументСформирован(Элемент)
	Если (Элемент.Документ <> Неопределено) И (Элемент.Документ.readyState = "complete")тогда
		ОтрисоватьШаблон();
	КонецЕсли;	
КонецПроцедуры // ШаблонТекстаДокументСформирован

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаНастройкиОтборов" Тогда
		Элементы.ДоступныеПоля.Видимость = ЛОЖЬ;
		Элементы.ДоступныеПоляОтбора.Видимость = ИСТИНА;
	Иначе
		Элементы.ДоступныеПоля.Видимость = ИСТИНА;
		Элементы.ДоступныеПоляОтбора.Видимость = ЛОЖЬ;
	КонецЕсли;
КонецПроцедуры // ГруппаСтраницыПриСменеСтраницы

&НаКлиенте
Процедура НастройкиОтбораПриИзменении(Элемент)
	Модифицированность = ИСТИНА;
КонецПроцедуры // НастройкиОтбораПриИзменении

&НаКлиенте
Процедура ДоступныеПоляОтбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Модифицированность = ИСТИНА;
КонецПроцедуры // ДоступныеПоляОтбораВыбор

&НаКлиенте
Процедура ДоступныеПоляОтбораОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Модифицированность = ИСТИНА;
КонецПроцедуры // ДоступныеПоляОтбораОкончаниеПеретаскивания

&НаКлиенте
Процедура РазделительЭлементовПовторяющейсяЧастиПриИзменении(Элемент)
	Модифицированность = ИСТИНА;
КонецПроцедуры // РазделительЭлементовПовторяющейсяЧастиПриИзменении

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШаблонЗаполнитьПримером(Команда)
	Если Объект.Последовательность.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ШаблонЗаполнитьПримеромОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Текущая настройка будет утеряна. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПримером();
	КонецЕсли;
КонецПроцедуры // ШаблонЗаполнитьПримером

&НаКлиенте
Процедура ШаблонСтрокаСимволов(Команда)
	Элементы.ДоступныеПоля.ТекущаяСтрока = 0;
	
	ДобавитьВШаблон();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСдвигВлево(Команда)
	Если Объект.Последовательность.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если (ТекущаяСтрока > 0)Тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока,-1);
		ТекущаяСтрока = ТекущаяСтрока-1;
	ИначеЕсли ТекущаяСтрока = 0 Тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока, Объект.Последовательность.Количество()-1);
		ТекущаяСтрока = Объект.Последовательность.Количество() - 1;
	КонецЕсли;
	
	Перенумерация();
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
	ЭтаФорма.Модифицированность = ИСТИНА;
КонецПроцедуры // ШаблонСдвигВлево

&НаКлиенте
Процедура ШаблонСдвигВправо(Команда)
	Если Объект.Последовательность.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если (ТекущаяСтрока >= 0) И (ТекущаяСтрока < Объект.Последовательность.Количество() - 1)тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока,1);
		ТекущаяСтрока = ТекущаяСтрока +1;
	ИначеЕсли (ТекущаяСтрока = Объект.Последовательность.Количество() - 1) тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока, -(Объект.Последовательность.Количество()-1));
		ТекущаяСтрока = 0;
	КонецЕсли;	
	
	Перенумерация();
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
	ЭтаФорма.Модифицированность = ИСТИНА;
КонецПроцедуры // ШаблонСдвигВправо

&НаКлиенте
Процедура ШаблонУдалитьПараметр(Команда)
	Если Объект.Последовательность.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоДоУдаления = Объект.Последовательность.Количество();
	
	Если (Объект.Последовательность.Количество() >= ТекущаяСтрока) Тогда
		Если СоставнойПараметр Тогда
			СоставнойПараметр = ЛОЖЬ;
			СоставнойПараметрПриИзменении(Элементы.СоставнойПараметр);
		КонецЕсли;
		
		Объект.Последовательность.Удалить(ТекущаяСтрока);
		
		ЭтаФорма.Модифицированность = ИСТИНА;
		
		Перенумерация();
		
		Если ТекущаяСтрока >= 1 ИЛИ ТекущаяСтрока = КоличествоДоУдаления - 1 Тогда
			ТекущаяСтрока = ?(ТекущаяСтрока > 0, ТекущаяСтрока - 1, 0);
		Иначе
			ТекущаяСтрока = 0;
		КонецЕсли;
		
		Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
		
	КонецЕсли;	
КонецПроцедуры // ШаблонУдалитьПараметр

&НаКлиенте
Процедура ШаблонУдалитьНастройку(Команда)
	Если Объект.Последовательность.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ШаблонУдалитьНастройкуОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Текущая настройка будет утеряна. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		УдалитьНастройку();
	КонецЕсли;
КонецПроцедуры // ШаблонУдалитьНастройку

&НаКлиенте
Процедура ОбразецСформировать(Команда)
	Отказ = Ложь;
	
	Если Объект.Последовательность.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Настройка отсутствует! Нет данных для формирования образца!'"), , "ШаблонТекста", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыбранныйДокумент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выберите документ для формирования образца!'"), , "ВыбранныйДокумент", , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ОбразецСформироватьОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Данные были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		СформироватьОбразецЗаполнения();
	КонецЕсли;
КонецПроцедуры // ОбразецСформировать

&НаКлиенте
Процедура УстановитьФорматПараметра(Команда)
	ТекФормат = Объект.Последовательность[ТекущаяСтрока];
	СуществующийФормат = ТекФормат.Формат;
	
	Если ТекФормат.Тип = "НДС" Тогда
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("ВидФормата", 1);
		ПараметрыФормы.Вставить("ТекущийФормат", ТекФормат.Формат);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("СуществующийФормат", СуществующийФормат);
		ДопПараметры.Вставить("ТекФормат", ТекФормат);
		ДопПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		ДопПараметры.Вставить("ВидФормата", 1);
		
		Оповещение = Новый ОписаниеОповещения("УстановитьФорматПараметраОповещение", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Справочник.ШаблоныЗаполненияПП.Форма.ФормаЗаданияФормата", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
	ИначеЕсли Лев(ТекФормат.Тип, 3) = "КБК" Тогда
		ПараметрыФормы = Новый Структура;
		ДанныеДляФормы = Новый Структура;
		
		ДанныеДляФормы.Вставить("РазбиватьПоГруппам", Прав(ТекФормат.Тип, 1) = "+");
		ДанныеДляФормы.Вставить("ТекущийФорматКБК", ТекФормат.Формат);
		
		ПараметрыФормы.Вставить("ВидФормата", 2);
		ПараметрыФормы.Вставить("ТекущийФормат", ДанныеДляФормы);
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("СуществующийФормат", СуществующийФормат);
		ДопПараметры.Вставить("ТекФормат", ТекФормат);
		ДопПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		ДопПараметры.Вставить("ВидФормата", 2);
		
		Оповещение = Новый ОписаниеОповещения("УстановитьФорматПараметраОповещение", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Справочник.ШаблоныЗаполненияПП.Форма.ФормаЗаданияФормата", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
	ИначеЕсли ТекФормат.Тип = "Число" ИЛИ
			ТекФормат.Тип = "Дата" ИЛИ
			ТекФормат.Тип = "Булево" Тогда
		Конструктор = Новый КонструкторФорматнойСтроки;
		Конструктор.ДоступныеТипы = Новый ОписаниеТипов(ТекФормат.Тип);
		Конструктор.Текст = ТекФормат.Формат;
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекФормат", ТекФормат);
		ДопПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
		
		Оповещение = Новый ОписаниеОповещения("КонструкторФорматаОповещение", ЭтотОбъект, ДопПараметры);
		Конструктор.Показать(Оповещение);
		
		Возврат;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбранный параметр не имеет форматирования!'"));
		Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры // УстановитьФорматПараметра

&НаКлиенте 
Процедура УстановитьСоставнойПараметр(Команда)
	Если Объект.Последовательность.Количество() = 0 Тогда
		СоставнойПараметр = ЛОЖЬ;
		Возврат;
	КонецЕсли;

	СоставнойПараметр = НЕ СоставнойПараметр;
	СоставнойПараметрПриИзменении(Элементы.СоставнойПараметр);
КонецПроцедуры // УстановитьСоставнойПараметр

&НаКлиенте
Процедура РедактироватьПараметрШаблона(Команда)
	ТекущийПараметр = Объект.Последовательность[ТекущаяСтрока];
	ТекущееЗначение = ТекущийПараметр.Данные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтрокаСимволов", ТекущийПараметр.Данные);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТекущийПараметр", ТекущийПараметр);
	ДопПараметры.Вставить("ТекущееЗначение", ТекущееЗначение);
	
	Оповещение = Новый ОписаниеОповещения("РедактироватьПараметрШаблонаОповещение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("Справочник.ШаблоныЗаполненияПП.Форма.ФормаВводаСтроки", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОбъектМетаданныхОчисткаОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ОбъектМетаданныхИмя = "";
		ДоступныеПоля.ПолучитьЭлементы().Очистить();
		Объект.Последовательность.Очистить();
		ПолучитьМакет();
		ОтрисоватьШаблон();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхОбработкаВыбораОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ОбъектМетаданныхИмя = ДопПараметры;
		ОбработатьВыборДокумента();		
	Иначе
		Объект.ОбъектМетаданныхИмя = ТекущийОбъектМетаданных;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаполнитьПримеромОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПримером();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонУдалитьНастройкуОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьНастройку();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбразецСформироватьОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		СформироватьОбразецЗаполнения();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВШаблонСтрокаСимволовОповещение(Результат, ДопПараметры) Экспорт
	Если Результат = "" ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		Если Результат = "Перевод строки" Тогда
			СтрокаСимволов = "10";
		ИначеЕсли Результат = "Неразрывный пробел" Тогда
			СтрокаСимволов = "160";
		ИначеЕсли Результат = "Табуляция" Тогда
			СтрокаСимволов = "9";
		Иначе
			СтрокаСимволов = Результат;
		КонецЕсли;
	
		СтрокаСимволов = СтрЗаменить(СтрокаСимволов, Символ(32), Символ(160));
	
		Стр = Объект.Последовательность.Добавить();
	
		Стр.ЭтоПутьКДанным = ЛОЖЬ;
	
		Если СтрокаСимволов = "10" Тогда
			Стр.Данные = Символ(Число(СтрокаСимволов));
			Стр.ПредставлениеПример = Символ(Число(СтрокаСимволов))+"<ПС>";
		ИначеЕсли СтрокаСимволов = "160" Тогда
			Стр.Данные = Символ(Число(СтрокаСимволов));
			Стр.ПредставлениеПример = Символ(Число(СтрокаСимволов))+"<НП>";
		ИначеЕсли СтрокаСимволов = "9" Тогда
			Стр.Данные = Символ(Число(СтрокаСимволов));
			Стр.ПредставлениеПример = Символ(Число(СтрокаСимволов))+"<ТАБ>";
		Иначе
			Стр.Данные = СтрокаСимволов;
			Стр.ПредставлениеПример = СтрокаСимволов;
		КонецЕсли;
	
		Стр.ТипПараметра = 1;
		
		Элементы.ГруппаКоманднаяПанельШаблона.ПодчиненныеЭлементы.ШаблонРедактироватьПараметр.Доступность = ИСТИНА;
		Элементы.ШаблонТекстаКонтекстноеМенюРедактировать.Доступность = ИСТИНА;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Последовательность.Количество() - 1;
	
	ОтрисоватьШаблон();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматПараметраОповещение(Результат, ДопПараметры) Экспорт
	Перем ТекФормат, СуществующийФормат, ТекущаяСтрока, ВидФормата;
	
	ДопПараметры.Свойство("ТекФормат", ТекФормат);
	ДопПараметры.Свойство("СуществующийФормат", СуществующийФормат);
	ДопПараметры.Свойство("ТекущаяСтрока", ТекущаяСтрока);
	ДопПараметры.Свойство("ВидФормата", ВидФормата);
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		ТекФормат.Формат = СуществующийФормат;
	Иначе
		ТекФормат.Формат = Результат;
	КонецЕсли;
	
	Если ВидФормата = 2 Тогда
		Если  СокрЛП(ТекФормат.Формат) <> "" Тогда
			ТекФормат.Тип = "КБК+";
		Иначе
			ТекФормат.Тип = "КБК-";
		КонецЕсли;
	КонецЕсли;
	
	Если ТекФормат.Формат <> СуществующийФормат Тогда
		Модифицированность = ИСТИНА;
	КонецЕсли;
	
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КонструкторФорматаОповещение(Результат, ДопПараметры) Экспорт
	Перем ТекФормат, СуществующийФормат, ТекущаяСтрока;
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Свойство("ТекФормат", ТекФормат);
	ДопПараметры.Свойство("СуществующийФормат", СуществующийФормат);
	ДопПараметры.Свойство("ТекущаяСтрока", ТекущаяСтрока);
	
	ТекФормат.Формат = Результат;
	
	Если ТекФормат.Формат <> СуществующийФормат Тогда
		Модифицированность = ИСТИНА;
	КонецЕсли;
	
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПараметрШаблонаОповещение(Результат, ДопПараметры) Экспорт
	Перем ТекущийПараметр, ТекущееЗначение;
	
	Если Результат = "" ИЛИ Результат = КодВозвратаДиалога.Отмена ИЛИ ТекущееЗначение = Результат ИЛИ Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Свойство("ТекущийПараметр", ТекущийПараметр);
	ДопПараметры.Свойство("ТекущееЗначение", ТекущееЗначение);
	
	Если Результат = "Перевод строки" Тогда
		СтрокаСимволов = "10";
	ИначеЕсли Результат = "Неразрывный пробел" Тогда
		СтрокаСимволов = "160";
	ИначеЕсли Результат = "Табуляция" Тогда
		СтрокаСимволов = "9";
	Иначе
		СтрокаСимволов = Результат;
	КонецЕсли;
		
	СтрокаСимволов = СтрЗаменить(СтрокаСимволов, Символ(32), Символ(160));
		
	Если СтрокаСимволов = "10" Тогда
		ТекущийПараметр.Данные = Символ(Число(СтрокаСимволов));
		ТекущийПараметр.ПредставлениеПример = Символ(Число(СтрокаСимволов))+"<ПС>";
	ИначеЕсли СтрокаСимволов = "160" Тогда
		ТекущийПараметр.Данные = Символ(Число(СтрокаСимволов));
		ТекущийПараметр.ПредставлениеПример = Символ(Число(СтрокаСимволов))+"<НП>";
	ИначеЕсли СтрокаСимволов = "9" Тогда
		ТекущийПараметр.Данные = Символ(Число(СтрокаСимволов));
		ТекущийПараметр.ПредставлениеПример = Символ(Число(СтрокаСимволов))+"<ТАБ>";
	Иначе
		ТекущийПараметр.Данные = СтрокаСимволов;
		ТекущийПараметр.ПредставлениеПример = СтрокаСимволов;
	КонецЕсли;
	
	Модифицированность = ИСТИНА;
	
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);	
КонецПроцедуры

#КонецОбласти

#Область ПостроениеДереваРеквизитов

&НаСервере
Процедура ИнициализироватьДоступныеПоля()
	
	ТипОбъектаМетаданных = "Документ";
	ОбъектМетаданных = Объект.ОбъектМетаданныхИмя;
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.ТипИсточникаДанных = "Local";
	ИсточникДанных.Имя = "ЭтаИБ";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.ИсточникДанных  = ИсточникДанных.Имя;
	НаборДанных.Имя = "РеквизитыДокумента";
	НаборДанных.Запрос = " ВЫБРАТЬ
						   |	ВыбДокумент.*
						   |ИЗ
						   |	" + ТипОбъектаМетаданных + "." + ОбъектМетаданных + " КАК ВыбДокумент";
											   
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки,);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(ИсточникНастроек);
	
	ИсточникЗначения = Компоновщик.Настройки.ДоступныеПоляВыбора.Элементы;
	
	СтрокаДерева = ДоступныеПоля.ПолучитьЭлементы().Добавить();
	СтрокаДерева.Имя = "СтрокаСимволов";
	СтрокаДерева.Представление = "Строка символов";
	
	Если УправлениеСвойствами.ИспользоватьДопРеквизиты(Документы[ОбъектМетаданных].ПустаяСсылка()) Тогда //ЕстьДопРеквизиты("Документ", ОбъектМетаданных) Тогда
		
		ДобавитьДопРеквизиты("Документ", ОбъектМетаданных);
		
	КонецЕсли;
	
	Если УправлениеСвойствами.ИспользоватьДопСведения(Документы[ОбъектМетаданных].ПустаяСсылка()) Тогда //ЕстьДопСведения("Документ", ОбъектМетаданных) Тогда
		
		ДобавитьДопСведения("Документ", ОбъектМетаданных);
		
	КонецЕсли;
	
	ДобавитьПодчиненныеУзел(ДоступныеПоля,ИсточникЗначения,0);
	
	Элементы.ВыбранныйДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка."+Объект.ОбъектМетаданныхИмя);
	
КонецПроцедуры // ИнициализироватьДоступныеПоля

&НаСервере
Процедура ДобавитьПодчиненныеУзел(ПриемникЗначения, ИсточникЗначения, Уровень)
	
	Для Каждого ЭлементИсточник Из ИсточникЗначения Цикл
		
		ФильтрЗаголовок = ВРЕГ(ЭлементИсточник.Заголовок);
		Если Найти(ЭлементИсточник.Заголовок, "Ссылка") > 0 ИЛИ 
			Найти(ЭлементИсточник.Заголовок, "Версия данных") > 0 ИЛИ 
			Найти(ЭлементИсточник.Заголовок, "Порядок") > 0 ИЛИ 
			Найти(ЭлементИсточник.Заголовок, "Предопределенный") > 0 ИЛИ
			Найти(ЭлементИсточник.Заголовок, "Пометка удаления") > 0 ИЛИ
			Найти(ЭлементИсточник.Заголовок, "Проведен") > 0 ИЛИ
			Найти(Строка(ЭлементИсточник.Поле), "Родитель.Родитель") > 0 ИЛИ
			Найти(Строка(ЭлементИсточник.Поле), "ГоловнаяОрганизация.ГоловнаяОрганизация") > 0 ИЛИ
			Найти(ЭлементИсточник.Заголовок, "Группа.Группа") > 0 ИЛИ
			Найти(ФильтрЗаголовок, "ЭТО ГРУППА") > 0 ИЛИ
			Найти(ФильтрЗаголовок, "ГРУППА") > 0 ИЛИ
			Найти(ФильтрЗаголовок, "РОДИТЕЛЬ") > 0 ИЛИ
			Найти(ФильтрЗаголовок, "ВЛАДЕЛЕЦ") > 0 ИЛИ
			ЭлементИсточник.Заголовок = "Системные поля" 
			ИЛИ (Строка(ЭлементИсточник.Поле) = "ДополнительныеРеквизиты" И ЭлементИсточник.Таблица)
			ИЛИ Найти(Строка(ЭлементИсточник.Поле), ".[") > 0
			ИЛИ Найти(Строка(ЭлементИсточник.Поле), ".Вес") > 0
			ИЛИ Найти(Строка(ЭлементИсточник.Поле), ".Родитель") > 0
			ИЛИ Найти(Строка(ЭлементИсточник.Поле), ".Владелец") > 0
			ИЛИ Найти(Строка(ЭлементИсточник.Поле), ".НомерСтроки") > 0
			ИЛИ Найти(Строка(ЭлементИсточник.Поле), ".ЗагружаетсяИзИнтернета") > 0
			Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(ЭлементИсточник.Заголовок, "Владелец") > 0 И ЭлементИсточник.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Организации")) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементИсточник.Таблица И НЕ ЭлементИсточник.Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементИсточник.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Валюты")) И НЕ ЭлементИсточник.Родитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		ЭлементПриемник 			= ПриемникЗначения.ПолучитьЭлементы().Добавить();
		ЭлементПриемник.Имя 		= ЭлементИсточник.Заголовок;
		Если Найти(Строка(ЭлементИсточник.Поле), "ХарактеристикиОбязательства") > 0
			 ИЛИ Найти(Строка(ЭлементИсточник.Поле), "ДополнительныеРеквизиты") > 0
			 ИЛИ Найти(Строка(ЭлементИсточник.Поле), "ДополнительныеСведения") > 0 Тогда
			Если ПриемникЗначения = ДоступныеПоля Тогда 
				ЭлементПриемник.ПутьКДанным = Строка(ЭлементИсточник.Поле);
			Иначе
				ЭлементПриемник.ПутьКДанным = ПриемникЗначения.ПутьКДанным + "." + 
						СтрЗаменить(Строка(ЭлементИсточник.Поле), 
						?(ЭлементИсточник.Родитель <> Неопределено, Строка(ЭлементИсточник.Родитель.Поле)+".", ""), "");
			КонецЕсли;
		Иначе
			ЭлементПриемник.ПутьКДанным = ЭлементИсточник.Поле;
		КонецЕсли;
		
		Если Строка(ЭлементИсточник.Поле) = "ХарактеристикиОбязательства"
			 ИЛИ Строка(ЭлементИсточник.Поле) = "ДополнительныеРеквизиты"
			 ИЛИ Строка(ЭлементИсточник.Поле) = "ДополнительныеСведения" тогда
			ЭлементПриемник.Таблица = ИСТИНА;
		Иначе
			ЭлементПриемник.Таблица	= ЭлементИсточник.Таблица;
		КонецЕсли;
		ЭлементПриемник.Тип			= ЭлементИсточник.Тип;
		
		Если ЭлементИсточник.Родитель = Неопределено 
			 ИЛИ Строка(ЭлементИсточник.Родитель.Поле) = "ХарактеристикиОбязательства"
			 ИЛИ Строка(ЭлементИсточник.Родитель.Поле) = "ДополнительныеРеквизиты"
			 ИЛИ Строка(ЭлементИсточник.Родитель.Поле) = "ДополнительныеСведения" тогда
			ЭлементПриемник.Представление	= ЭлементИсточник.Заголовок;
		Иначе	
			ЭлементПриемник.Представление	= Прав(ЭлементИсточник.Заголовок,СтрДлина(ЭлементИсточник.Заголовок)-СтрДлина(ЭлементИсточник.Родитель.Заголовок)-1);
		Конецесли;
		
		Если ЭлементПриемник.Тип = Новый ОписаниеТипов("СправочникСсылка.Договоры") Тогда
			ДобавитьХарактеристикиДоговоров(ЭлементПриемник, Уровень);
			
			НомерОбязательства = ЭлементПриемник.ПолучитьЭлементы().Добавить();
			НомерОбязательства.Имя = "Учетный номер обязательства";
			НомерОбязательства.Представление = "Учетный номер обязательства";
			НомерОбязательства.ПутьКДанным = ЭлементПриемник.ПутьКДанным + ".УчетныйНомерОбязательства";
			НомерОбязательства.Таблица = ЛОЖЬ;
			НомерОбязательства.Тип = ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(20);
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ЭлементИсточник.Тип.ПривестиЗначение())) И
			ЭлементИсточник.Тип.ПривестиЗначение() <> Неопределено Тогда
			
			Если Метаданные.Справочники.Содержит(ЭлементИсточник.Тип.ПривестиЗначение().Метаданные()) Тогда
				Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ЭлементИсточник.Тип.ПривестиЗначение()) И 
					(ЭлементИсточник.Родитель = Неопределено ИЛИ НЕ Строка(ЭлементИсточник.Родитель.Поле) = "ДополнительныеРеквизиты") Тогда
					//ЕстьДопРеквизиты("Справочник", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя) Тогда
					ДобавитьДопРеквизиты("Справочник", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя, ЭлементПриемник, Уровень);
				КонецЕсли;
				
				Если УправлениеСвойствами.ИспользоватьДопСведения(ЭлементИсточник.Тип.ПривестиЗначение()) И 
					(ЭлементИсточник.Родитель = Неопределено ИЛИ НЕ Строка(ЭлементИсточник.Родитель.Поле) = "ДополнительныеСведения") Тогда 
					
					//ЕстьДопСведения("Справочник", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя) Тогда
					ДобавитьДопСведения("Справочник", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя, ЭлементПриемник, Уровень);
				КонецЕсли;
			КонецЕсли;
		
			Если Метаданные.Документы.Содержит(ЭлементИсточник.Тип.ПривестиЗначение().Метаданные()) Тогда
				Если УправлениеСвойствами.ИспользоватьДопРеквизиты(ЭлементИсточник.Тип.ПривестиЗначение()) И 
					(ЭлементИсточник.Родитель = Неопределено ИЛИ НЕ Строка(ЭлементИсточник.Родитель.Поле) = "ДополнительныеРеквизиты") Тогда
					//ЕстьДопРеквизиты("Документ", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя) Тогда
					ДобавитьДопРеквизиты("Документ", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя, ЭлементПриемник, Уровень);
				КонецЕсли;
				
				Если УправлениеСвойствами.ИспользоватьДопСведения(ЭлементИсточник.Тип.ПривестиЗначение()) И 
					(ЭлементИсточник.Родитель = Неопределено ИЛИ НЕ Строка(ЭлементИсточник.Родитель.Поле) = "ДополнительныеСведения") Тогда
					
					//ЕстьДопСведения("Документ", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя) Тогда
					ДобавитьДопСведения("Документ", ЭлементИсточник.Тип.ПривестиЗначение().Метаданные().Имя, ЭлементПриемник, Уровень);
				КонецЕсли;
			КонецЕсли;		
			
		КонецЕсли;
		
		Если Уровень > 1 тогда
			Продолжить;
		КонецЕсли;	
		
		Если ЭлементИсточник.Элементы.Количество() > 0 Тогда
			ДобавитьПодчиненныеУзел(ЭлементПриемник, ЭлементИсточник.Элементы, Уровень + 1);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПРоцедуры // ДобавитьПодчиненныеУзел

&НаСервере
Процедура ДобавитьХарактеристикиДоговоров(Узел, Уровень = 0)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Характеристики.Наименование КАК Имя,
	               |	Характеристики.Наименование КАК Представление,
	               |	Характеристики.ТипЗначения КАК Тип,
	               |	""ПланВидовХарактеристик"" КАК ПутьКДанным,
	               |	ИСТИНА КАК Таблица,
	               |	""ПланВидовХарактеристик"" КАК ИмяТаблицы
	               |ИЗ
	               |	ПланВидовХарактеристик.ВидыХарактеристикОбязательства КАК Характеристики
	               |ГДЕ
	               |	Характеристики.ЭтоГруппа = ЛОЖЬ";
					
	Результат = Запрос.Выполнить().Выгрузить();
	
	Схема = Новый СхемаКомпоновкиДанных;
	
	Источник = Схема.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.ТипИсточникаДанных = "local";
	
	Набор = Схема.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	Набор.Имя = "Набор1";
	Набор.ИсточникДанных = "Источник1";
	
	К = 1;
	
	Для Каждого Поле Из Результат Цикл
		НовоеПоле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		
		НовоеПоле.Поле = "ХарактеристикиОбязательства.Характеристика" + К;
		НовоеПоле.Заголовок = Строка(Поле.Имя);
		НовоеПоле.ВыражениеПредставления = НовоеПоле.Заголовок;
		НовоеПоле.ТипЗначения = Поле.Тип;
		
		К = К + 1;
	КонецЦикла;
	
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Источник);
	
	ИсточникДанных = Компоновщик.Настройки.ДоступныеПоляВыбора.Элементы;
	
	ДобавитьПодчиненныеУзел(Узел, ИсточникДанных, 1);
	
КонецПроцедуры // ДобавитьХарактеристикиДоговоров

&НаСервере
Процедура ДобавитьДопРеквизиты(ПерваяЧастьИмени, ВтораяЧастьИмени, Узел = Неопределено, Уровень = 0)
	
	Если ВтораяЧастьИмени = "НаборыДополнительныхРеквизитовИСведений" Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДопРеквизиты.Свойство КАК Имя,
	               |	ДопРеквизиты.Свойство.Наименование КАК Представление,
	               |	ДопРеквизиты.Свойство.ТипЗначения КАК Тип,
	               |	""ДополнительныеРеквизиты"" КАК ПутьКДанным,
	               |	ИСТИНА КАК Таблица,
	               |	""ДополнительныеРеквизиты"" КАК ИмяТаблицы
	               |ИЗ
	               |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК ДопРеквизиты
	               |ГДЕ
	               |	ДопРеквизиты.Ссылка = &СсылкаНаОбъект";
					
	Запрос.УстановитьПараметр("СсылкаНаОбъект", УправлениеСвойствами.НаборСвойствПоИмени(ПерваяЧастьИмени+"_"+ВтораяЧастьИмени));

	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Схема = Новый СхемаКомпоновкиДанных;
	
	Источник = Схема.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.ТипИсточникаДанных = "local";
	
	Набор = Схема.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	Набор.Имя = "Набор1";
	Набор.ИсточникДанных = "Источник1";
	
	К = 1;
	
	Для Каждого Поле Из Результат Цикл
		НовоеПоле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		
		НовоеПоле.Поле = "ДополнительныеРеквизиты.ДопРеквизит" + К;
		НовоеПоле.Заголовок = Строка(Поле.Имя);
		НовоеПоле.ВыражениеПредставления = НовоеПоле.Заголовок;
		НовоеПоле.ТипЗначения = Поле.Тип;
		
		К = К + 1;
	КонецЦикла;
	
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Источник);
	
	ИсточникДанных = Компоновщик.Настройки.ДоступныеПоляВыбора.Элементы;
	
	Если ИсточникДанных.Количество() > 0 Тогда
		Если Узел = Неопределено Тогда
			Узел = ДоступныеПоля;
		КонецЕсли;
	
		ДобавитьПодчиненныеУзел(Узел, ИсточникДанных, 1);
	КонецЕсли;
	
КонецПроцедуры // ДобавитьДопРеквизиты

&НаСервере
Процедура ДобавитьДопСведения(ПерваяЧастьИмени, ВтораяЧастьИмени, Узел = Неопределено, Уровень = 0)
	
	Если ВтораяЧастьИмени = "НаборыДополнительныхРеквизитовИСведений" Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ДопСведения.Свойство КАК Имя,
					|	ДопСведения.Свойство.Наименование КАК Представление,
					|	ДопСведения.Свойство.ТипЗначения КАК Тип,
					|	""ДополнительныеСведения"" КАК ПутьКДанным,
					|	ИСТИНА КАК Таблица,
					|	""ДополнительныеСведения"" КАК ИмяТаблицы
					|ИЗ
					|	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК ДопСведения
					|ГДЕ
					|	ДопСведения.Ссылка = &СсылкаНаОбъект";
					
	Запрос.УстановитьПараметр("СсылкаНаОбъект", УправлениеСвойствами.НаборСвойствПоИмени(ПерваяЧастьИмени+"_"+ВтораяЧастьИмени));

	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Схема = Новый СхемаКомпоновкиДанных;
	
	Источник = Схема.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.ТипИсточникаДанных = "local";
	
	Набор = Схема.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	Набор.Имя = "Набор1";
	Набор.ИсточникДанных = "Источник1";
	
	К = 1;
	
	Для Каждого Поле Из Результат Цикл
		НовоеПоле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		
		НовоеПоле.Поле = "ДополнительныеСведения.ДопСведение" + К;
		НовоеПоле.Заголовок = Строка(Поле.Имя);
		НовоеПоле.ВыражениеПредставления = НовоеПоле.Заголовок;
		НовоеПоле.ТипЗначения = Поле.Тип;
		
		К = К + 1;
	КонецЦикла;
	
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Источник);
	
	ИсточникДанных = Компоновщик.Настройки.ДоступныеПоляВыбора.Элементы;
	
	Если ИсточникДанных.Количество() > 0 Тогда
		Если Узел = Неопределено Тогда
			Узел = ДоступныеПоля;
		КонецЕсли;
	
		ДобавитьПодчиненныеУзел(Узел, ИсточникДанных, 1);
	КонецЕсли;
	
КонецПроцедуры // ДобавитьДопСведения

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСДеревомРеквизитов

&НаКлиенте 
Процедура ДобавитьВШаблон(ТекущиеДанные = Неопределено)
	
	Если ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные = Элементы.ДоступныеПоля.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные.Таблица Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = ИСТИНА;

	Если ТекущиеДанные.Имя = "СтрокаСимволов" Тогда
		Оповещение = Новый ОписаниеОповещения("ДобавитьВШаблонСтрокаСимволовОповещение", ЭтотОбъект);
		ОткрытьФорму("Справочник.ШаблоныЗаполненияПП.Форма.ФормаВводаСтроки", , ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
	ИначеЕсли Найти(ТекущиеДанные.ПутьКДанным, "ДополнительныеРеквизиты") > 0 Тогда
		Стр = Объект.Последовательность.Добавить();
		
		Стр.ТипПараметра = 4;
		ПутьКДанным = Лев(ТекущиеДанные.ПутьКДанным, Найти(ТекущиеДанные.ПутьКДанным, "ДопРеквизит") - 1) + "[" + ТекущиеДанные.Имя + "]";
		Стр.ПутьКДанным = ПутьКДанным;
		Стр.ПредставлениеПример = "[" + ТекущиеДанные.Представление + "]";
		
		Объект.ИспользуютсяДопРеквизиты = ИСТИНА;
	ИначеЕсли Найти(ТекущиеДанные.ПутьКДанным, "ДополнительныеСведения") > 0 Тогда
		Стр = Объект.Последовательность.Добавить();
		
		Стр.ТипПараметра = 5;
		ПутьКДанным = Лев(ТекущиеДанные.ПутьКДанным, Найти(ТекущиеДанные.ПутьКДанным, "ДопСведение") - 1) + "[" + ТекущиеДанные.Имя + "]";
		Стр.ПутьКДанным = ПутьКДанным;
		Стр.ПредставлениеПример = "[" + ТекущиеДанные.Представление + "]";
		
		Объект.ИспользуютсяДопСведения = ИСТИНА;
	ИначеЕсли Найти(ТекущиеДанные.ПутьКДанным, "ХарактеристикиОбязательства") > 0 Тогда
		Стр = Объект.Последовательность.Добавить();
		
		Стр.ТипПараметра = 6;
		
		ПутьКДанным = Лев(ТекущиеДанные.ПутьКДанным, Найти(ТекущиеДанные.ПутьКДанным, "Характеристика") - 1) + "[" + ТекущиеДанные.Имя + "]";
		Стр.ПутьКДанным = ПутьКДанным;
		Стр.ПредставлениеПример = "[" + ТекущиеДанные.Представление + "]";
		
		Объект.ИспользуютсяХарактеристики = ИСТИНА;
	ИначеЕсли Найти(ТекущиеДанные.ПутьКДанным, "УчетныйНомерОбязательства") > 0 Тогда
		Стр = Объект.Последовательность.Добавить();
		
		Стр.ТипПараметра = 7;
		Стр.ПутьКДанным = ТекущиеДанные.ПутьКДанным;
		Стр.ПредставлениеПример = "[" + ТекущиеДанные.Представление + "]";
		
		Объект.ИспользуетсяУчетныйНомер = ИСТИНА;
	ИначеЕсли Найти(ТекущиеДанные.ПутьКДанным, ".") = 0 Тогда // Это реквизит шапки
		Стр = Объект.Последовательность.Добавить();
		
		Стр.ТипПараметра = 2;
		Стр.ПутьКДанным = ТекущиеДанные.ПутьКДанным;
		Стр.ПредставлениеПример = "[" + ТекущиеДанные.Представление + "]";
	ИначеЕсли Найти(ТекущиеДанные.ПутьКДанным, ".") > 0 Тогда // Проверяем на принадлежность к реквизиту ТЧ
		ИмяТЧ = Лев(ТекущиеДанные.ПутьКДанным, Найти(ТекущиеДанные.ПутьКДанным, ".") - 1);
		
		Стр = Объект.Последовательность.Добавить();
		
		Если ЭтоТЧ(ИмяТЧ) Тогда
			Стр.ТипПараметра = 3;
			Стр.ИмяТаблицы = ИмяТЧ;
		Иначе
			Стр.ТипПараметра = 2;
		КонецЕсли;
		
		Стр.ПутьКДанным = ТекущиеДанные.ПутьКДанным;
		Стр.ПредставлениеПример = "[" + ТекущиеДанные.Представление + "]";
	КонецЕсли;
	
	Стр.НомерСтрокиДерева = Элементы.ДоступныеПоля.ТекущаяСтрока;
	
	Если ТекущиеДанные.ПутьКДанным = "СуммаНДС" Тогда
		Стр.Формат = ФорматНДСПоУмолчанию(); //ЗадатьСтрокуФорматаНДСПоУмолчанию();
		ПредставлениеФормата = ПредставлениеФорматаНДС(Стр.Формат);
		Стр.Тип = "НДС";
	ИначеЕсли ТипЗнч(ТекущиеДанные.Тип.ПривестиЗначение()) = Тип("Дата") Тогда
		Стр.Формат = "ДФ='дд.ММ.гггг'";
		ПредставлениеФормата = Формат(ТекущаяДата(), Стр.Формат);
		Стр.Тип = "Дата";
	ИначеЕсли ТипЗнч(ТекущиеДанные.Тип.ПривестиЗначение()) = Тип("Число") Тогда
		Стр.Формат = "ЧДЦ = '2'";
		ПредставлениеФормата = Формат(999999.99, Стр.Формат);
		Стр.Тип = "Число";
	ИначеЕсли ТипЗнч(ТекущиеДанные.Тип.ПривестиЗначение()) = Тип("Булево") Тогда
		Стр.Формат = "БЛ = 'Нет'; БИ = 'Да'";
		ПредставлениеФормата = "Ложь: " + Формат(ЛОЖЬ, Стр.Формат) + "; Истина: " + Формат(ИСТИНА, Стр.Формат);
		Стр.Тип = "Булево";
	ИначеЕсли ТипЗнч(ТекущиеДанные.Тип.ПривестиЗначение()) = Тип("СправочникСсылка.КлассификационныеПризнакиСчетов") Тогда
		ФорматКБКПоУмолчанию();
		Стр.Формат = ФорматКБКВСтроку(); //ЗадатьФорматКБКПоУмолчанию();
		ПредставлениеФормата = "КБК с разбиением на группы";
		Стр.Тип = "КБК+";
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Последовательность.Количество() - 1;
	
	ОтрисоватьШаблон();
	
КонецПроцедуры // ДобавитьВШаблон

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьНастройку()
	Объект.Последовательность.Очистить();
	Объект.ИспользуетсяУчетныйНомер = ЛОЖЬ;
	Объект.ИспользуютсяДопРеквизиты = ЛОЖЬ;
	Объект.ИспользуютсяДопСведения = ЛОЖЬ;
	Объект.ИспользуютсяХарактеристики = ЛОЖЬ;
	ТекущаяСтрока = 0;
	ПолучитьМакет();
	
	ЭтаФорма.Модифицированность = ИСТИНА;
	
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПримером()
	Объект.Последовательность.Очистить();
	
	Объект.РазделительЭлементовПовторяющейсяЧасти = ";";
	НоваяСтрока = Объект.Последовательность.Добавить();
	НоваяСтрока.ПредставлениеПример = Нстр("ru='(Л/С '");
	НоваяСтрока.ТипПараметра = 1;
	НоваяСтрока.Данные = Нстр("ru='(Л/С '");
	
	НоваяСтрока = Объект.Последовательность.Добавить();
	НоваяСтрока.ЭтоПутьКДанным = Истина;
	НоваяСтрока.ПутьКДанным = "ЛицевойСчет";
	НоваяСтрока.ПредставлениеПример = Нстр("ru='[Лицевой счет]'");
	НоваяСтрока.ТипПараметра = 2;
	
	НоваяСтрока = Объект.Последовательность.Добавить();
	НоваяСтрока.ПредставлениеПример = Нстр("ru=') '");
	НоваяСтрока.ТипПараметра = 1;
	НоваяСтрока.Данные = Нстр("ru=') '");
	
	Если Объект.ОбъектМетаданныхИмя = "ЗаявкаНаКассовыйРасход" тогда
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=' Оплата за '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=' Оплата за '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "РеквизитыДокументаОснования.ДокументОснованиеПредмет";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Предмет документа-основания]'");
		НоваяСтрока.ИмяТаблицы = "РеквизитыДокументаОснования";
		НоваяСтрока.ТипПараметра = 3;
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=' по документу № '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=' по документу № '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "РеквизитыДокументаОснования.ДокументОснованиеНомер";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Номер документа-основания]'");
		НоваяСтрока.ИмяТаблицы = "РеквизитыДокументаОснования";
		НоваяСтрока.ТипПараметра = 3;
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=' от '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=' от '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "РеквизитыДокументаОснования.ДокументОснованиеДата";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Дата документа-основания]'");
		НоваяСтрока.ИмяТаблицы = "РеквизитыДокументаОснования";
		НоваяСтрока.Формат = "ДФ='dd.MM.yyyy'";
		НоваяСтрока.ТипПараметра = 3;
		НоваяСтрока.Тип = "Дата";
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=', '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=', '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "СуммаНДС";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Сумма НДС]'");
		НоваяСтрока.Формат = ФорматНДСПоУмолчанию();
		НоваяСтрока.ТипПараметра = 2;
		НоваяСтрока.Тип = "НДС";
	ИначеЕсли Объект.ОбъектМетаданныхИмя = "ЗаявкаНаКассовыйРасходСокращенная" Тогда
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=' Оплата по '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=' Оплата по '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "ДокументОснованиеВид";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Вид документа-основания]'");
		НоваяСтрока.ТипПараметра = 2;
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=' № '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=' № '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "ДокументОснованиеНомер";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Номер документа-основания]'");
		НоваяСтрока.ТипПараметра = 2;
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=' от '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=' от '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "ДокументОснованиеДата";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Дата документа-основания]'");
		НоваяСтрока.Формат = "ДФ = 'dd.MM.yyyy'";
		НоваяСтрока.ТипПараметра = 2;
		НоваяСтрока.Тип = "Дата";
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ПредставлениеПример = Нстр("ru=', '");
		НоваяСтрока.ТипПараметра = 1;
		НоваяСтрока.Данные = Нстр("ru=', '");
		
		НоваяСтрока = Объект.Последовательность.Добавить();
		НоваяСтрока.ЭтоПутьКДанным = Истина;
		НоваяСтрока.ПутьКДанным = "СуммаНДС";
		НоваяСтрока.ПредставлениеПример = Нстр("ru='[Сумма НДС]'");
		НоваяСтрока.Формат = ФорматНДСПоУмолчанию();
		НоваяСтрока.ТипПараметра = 2;
		НоваяСтрока.Тип = "НДС";
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Последовательность.Количество() - 1;
	
	Оповестить("СменилсяТекущийПараметрШаблона", ТекущаяСтрока, ЭтаФорма);
	
	ЭтаФорма.Модифицированность = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокумента()
	ДоступныеПоля.ПолучитьЭлементы().Очистить();
	
	Объект.Последовательность.Очистить();
	Объект.ПредставлениеОбъекта = Объект.ОбъектМетаданныхИмя;
	
	ИнициализироватьДоступныеПоля();
	СчитатьНастройкиОтборов();
	
	ТекущаяСтрока = 0;
	
	ПолучитьМакет();
	
	ОтрисоватьШаблон();
КонецПроцедуры

&НаСервере
Функция ЭтоТЧ(ИмяТЧ)
	Возврат Метаданные.Документы[Объект.ОбъектМетаданныхИмя].ТабличныеЧасти.Найти(ИмяТЧ) <> Неопределено;
КонецФункции // ЭтоТЧ

&НаСервере
Функция ФорматКБКВСтроку()
	Возврат Справочники.ШаблоныЗаполненияПП.ФорматКБКВСтроку(РеквизитФормыВЗначение("ТекущийФорматКБК"), РазделительРазрядовКБК);
КонецФункции

&НаСервере
Процедура ФорматКБКПоУмолчанию()
	ЗначениеВРеквизитФормы(Справочники.ШаблоныЗаполненияПП.ЗадатьФорматКБКПоУмолчанию(), "ТекущийФорматКБК");
КонецПроцедуры

&НаСервере
Функция ФорматНДСПоУмолчанию() //
	Возврат Справочники.ШаблоныЗаполненияПП.ЗадатьСтрокуФорматаНДСПоУмолчанию();
КонецФункции // ФорматНДСПоУмолчанию

&НаСервере
Функция ПредставлениеФорматаНДС(ФорматНДС, СуммаНДС = Неопределено) //
	Если ФорматНДС <> "" Тогда
		НДС_ВыводитьСтавкуНДС = Булево(СтрПолучитьСтроку(ФорматНДС, 1));
		НДС_ТекстСтавкаНДС = СтрПолучитьСтроку(ФорматНДС, 2);
		НДС_ВыводитьСуммуНДС = Булево(СтрПолучитьСтроку(ФорматНДС, 3));
		НДС_ТекстСуммаНДС = СтрПолучитьСтроку(ФорматНДС, 4);
		НДС_ФорматСуммыНДС = СтрПолучитьСтроку(ФорматНДС, 5);
		НДС_ВыводитьТекстБезНДС = Булево(СтрПолучитьСтроку(ФорматНДС, 6));
		НДС_ТекстБезНДС = СтрПолучитьСтроку(ФорматНДС, 7);
		
		Если СтрЧислоСтрок(ФорматНДС) = 8 Тогда
			НДС_Валюта = СтрПолучитьСтроку(ФорматНДС, 8);
		Иначе
			НДС_Валюта = "руб.";
		КонецЕсли;
		
		Возврат ?(НДС_ВыводитьСтавкуНДС, НДС_ТекстСтавкаНДС + " 18% ", "") + 
				?(НДС_ВыводитьСуммуНДС, НДС_ТекстСуммаНДС + " " + 
						Формат(?(СуммаНДС<>Неопределено, СуммаНДС, 999.99), НДС_ФорматСуммыНДС) + " " + НДС_Валюта, "") +
				?(НДС_ВыводитьТекстБезНДС, " / " + НДС_ТекстБезНДС, "");
	Иначе
		Возврат "";			
	КонецЕсли;
КонецФункции // ПредставлениеФорматаНДС

&НаКлиенте
Процедура Перенумерация()
	
	НомерВПоследовательности = 0;
	МассивТЧ = Новый Массив;
	
	Для К = 0 По Объект.Последовательность.Количество() - 1 Цикл
		Стр = Объект.Последовательность[К];
		
		Если Стр.НомерВПоследовательности > 0 Тогда
			Если Стр.ИмяТаблицы <> "" Тогда
				Если МассивТЧ.Найти(Стр.ИмяТаблицы) = Неопределено	Тогда
					Если МассивТЧ.Количество() = 1 Тогда
						НомерВПоследовательности = 0;
						Стр.НомерВПоследовательности = 0;
						МассивТЧ.Очистить();
						Продолжить;
					Иначе
						МассивТЧ.Добавить(Стр.ИмяТаблицы);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			НомерВПоследовательности = НомерВПоследовательности + 1;
			Стр.НомерВПоследовательности = НомерВПоследовательности;
		Иначе
			МассивТЧ.Очистить();
			НомерВПоследовательности = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // Перенумерация

&НаСервере
Процедура СчитатьНастройкиОтборов()
	Настройки = РеквизитФормыВЗначение("Объект").Отбор.Получить();
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "ИсточникДанных1";
	Источник.ТипИсточникаДанных = "local";
	
	ЗаполнитьОтборДоступнымиПолями(СхемаКомпоновки);
		
	АдресСКДДляОтборов = ПоместитьВоВременноеХранилище(СхемаКомпоновки, ЭтаФорма.УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКДДляОтборов);	
	
	НастройкиОтбора.Инициализировать(ИсточникНастроек);
	
	Если Настройки = Неопределено Тогда
		НастройкиОтбора.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	Иначе
		НастройкиОтбора.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	
КонецПроцедуры // СчитатьНастройкиОтборов

&НаСервере
Процедура ЗаполнитьОтборДоступнымиПолями(Схема)
	Набор = Схема.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	Набор.ИсточникДанных = "ИсточникДанных1";
	Набор.Имя = "ОсновнойНаборДанных";
	Набор.ИмяОбъекта = Набор.Имя;
	
	МД = Метаданные.Документы[Объект.ОбъектМетаданныхИмя];
	
	Для Каждого Реквизит Из МД.Реквизиты Цикл
		Если Реквизит.Имя = "Номер" ИЛИ
				Реквизит.Имя = "Дата" ИЛИ
				Найти(Реквизит.Имя, "Сумма") > 0 ИЛИ
				Реквизит.Имя = "НазначениеПлатежа" Тогда
			Продолжить;
		КонецЕсли;
	
		НовоеПоле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.ВыражениеПредставления = Реквизит.Синоним;
		НовоеПоле.Поле = Реквизит.Имя;
		НовоеПоле.ПутьКДанным = Реквизит.Имя;
		НовоеПоле.ТипЗначения = Реквизит.Тип;
	КонецЦикла;
	
	НовоеПоле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПоле.ВыражениеПредставления = "Ссылка";
	НовоеПоле.Поле = "Ссылка";
	НовоеПоле.ПутьКДанным = "Ссылка";
	НовоеПоле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ШаблоныЗаполненияПП");
	НовоеПоле.ОграничениеИспользования.Условие = ИСТИНА;
	НовоеПоле.ОграничениеИспользованияРеквизитов.Условие = ИСТИНА;
	
	Настройки = Схема.НастройкиПоУмолчанию;
	
	ДетальныеЗаписи = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ДетальныеЗаписи.Имя = "ДетальныеЗаписи";
	ДетальныеЗаписи.Использование = ИСТИНА;
	
	ГруппировкаСсылка = ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ГруппировкаСсылка.Использование = ИСТИНА;
	ГруппировкаСсылка.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
КонецПроцедуры // ЗаполнитьОтборДоступнымиПолями

&НаСервере
Процедура СформироватьОбразецЗаполнения()
	ОбразецФормирования = РеквизитФормыВЗначение("Объект").СформироватьНазначениеПлатежа(ВыбранныйДокумент.ПолучитьОбъект());
КонецПроцедуры // СформироватьОбразецЗаполнения

#КонецОбласти

#Область ПроцедурыИФункцииВизуализацииШаблонаВПолеHTMLДокумента

&НаСервере
Процедура ПолучитьМакет()
	
	Макет =  РеквизитФормыВЗначение("Объект").ПолучитьМакет("HTMLТекстШаблона");
	ШаблонТекста = Макет.ПолучитьТекст();
	
КонецПроцедуры // ПолучитьМакет

&НаКлиенте
ПРоцедура ДобавитьУзлы(Док, ТекУзел, ТекСтрока)
	ТекущаяПозиция = 0;
	Для К = 0 По Объект.Последовательность.Количество() - 1 Цикл
		Строка = Объект.Последовательность[К];
		
		Если Строка.НомерВПоследовательности = 0 Тогда
			Узел = Док.createElement("SPAN");
			Узел.dataFld = Строка.Данные;
		
			Если Строка.ТипПараметра = 1 Тогда
				Если СокрЛП(Строка.ПредставлениеПример) = "" Тогда
					Узел.className = "spacedPart"
				ИначеЕсли Найти(Строка.ПредставлениеПример, "<ПС>") > 0 ИЛИ
						Найти(Строка.ПредставлениеПример, "<НП>") > 0 ИЛИ
						Найти(Строка.ПредставлениеПример, "<ТАБ>") > 0 Тогда
					Узел.className = "specialSymbol";
				Иначе
					Узел.className = "textPart";
				КонецЕсли;
			Иначе 	
				Узел.className = "fieldReference";
			КонецЕсли;
			
			Если ТекСтрока <> Неопределено И ТекСтрока = ТекущаяПозиция тогда
				Узел.className = "selectedPart";		
			КонецЕсли;
		
			Узел.id = Строка.НомерСтроки;
			Узел.title = Строка.ПредставлениеПример;
			Если Узел.innerText = Неопределено Тогда
				Узел.textContent = Строка.ПредставлениеПример;
			Иначе
				Узел.innerText = Строка.ПредставлениеПример;
			КонецЕсли;
		Иначе
			Узел = Док.createElement("SPAN");
			Узел.className = "compositePart";
			
			Пока ИСТИНА Цикл
				Если Объект.Последовательность[К].НомерВПоследовательности = 0 Тогда
					К = К - 1;
					ТекущаяПозиция = ТекущаяПозиция - 1;
					Прервать;
				КонецЕсли;
				
				ПодУзел = Док.createElement("SPAN");
				
				Если Строка.ТипПараметра = 1 Тогда
					Если СокрЛП(Строка.ПредставлениеПример) = "" Тогда
						ПодУзел.className = "spacedPart";
					ИначеЕсли Найти(Строка.ПредставлениеПример, "<ПС>") > 0 ИЛИ
							Найти(Строка.ПредставлениеПример, "<НП>") > 0 ИЛИ
							Найти(Строка.ПредставлениеПример, "<ТАБ>") > 0 Тогда
						ПодУзел.className = "specialSymbol";
					Иначе
						ПодУзел.className = "textPart";
					КонецЕсли;
				Иначе 	
					ПодУзел.className = "fieldReference";
				КонецЕсли;
				
				Если ТекСтрока <> Неопределено И ТекСтрока = ТекущаяПозиция тогда
					ПодУзел.className = "selectedPart";		
				КонецЕсли;
				
				ПодУзел.id = Строка.НомерСтроки;
				ПодУзел.title = Строка.ПредставлениеПример;
				Если ПодУзел.innerText = Неопределено Тогда
					ПодУзел.textContent = Строка.ПредставлениеПример;
				Иначе
					ПодУзел.innerText = Строка.ПредставлениеПример;
				КонецЕсли;
				
				Узел.appendChild(ПодУзел);
				
				ТекущаяПозиция = ТекущаяПозиция + 1;
				
				Если К < Объект.Последовательность.Количество() - 1 Тогда
					К = К + 1;
					Строка = Объект.Последовательность[К];
				Иначе
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ТекУзел.appendChild(Узел);
		
		ТекущаяПозиция = ТекущаяПозиция + 1;
	КонецЦикла;	
КонецПРоцедуры // ДобавитьУзлы	

&НаКлиенте
Процедура ОтрисоватьШаблон(НомерСтроки = 0)
		
	Док = Док();
	
	Если Док.readyState <> "complete" Тогда
		Возврат;
	КонецЕсли;
	
	МастерУзел = Док.getElementById("templateContainer");
	КонтрольныйУзел = Док.getElementById("deldef");
	Если КонтрольныйУзел.childNodes.length = 0 тогда
		ДобавитьУзлы(Док, КонтрольныйУзел, 0);
		СтароеНачало = НомерСтроки;
	Иначе
		УдалитьДочерниеУзлы(КонтрольныйУзел);
		Узел = Док.createElement("DIV");
		Узел.id = "deldef";
		МастерУзел.appendChild(Узел);
		КонтрольныйУзел    = Док.getElementById("deldef");
		ДобавитьУзлы(Док, КонтрольныйУзел, ТекущаяСтрока);
	КонецЕсли;	
	
КонецПРоцедуры	// ОтрисоватьШаблон

&НаКлиенте
Функция Док()
	Возврат Элементы.ШаблонТекста.Документ;
КонецФункции // Док

&НаКлиенте
Процедура УдалитьДочерниеУзлы(Узел)
	
	Если Узел.lastChild = Неопределено ИЛИ Узел.children = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	УдалитьДочерниеУзлы(Узел.lastChild);
	
	Узел.parentNode.removeChild(Узел);
	
КонецПроцедуры // УдалитьДочерниеУзлы

#КонецОбласти

#КонецОбласти
